In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).**

In [3]:
df['FlightNumber']=df['FlightNumber'].interpolate().astype(int)
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

**2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

In [4]:
temp=df.From_To.str.split('_',expand=True)
temp.columns=['From','To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)**

In [ ]:
temp['From']=temp['From'].str.capitalize()
temp['To']=temp['To'].str.capitalize()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

**4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.**

In [5]:
df=df.drop('From_To',axis=1)
df=df.join(temp)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

**5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the valueshould be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.**

In [7]:
#apply function is used to invoke a python function on values of series.

delays=df['RecentDelays'].apply(pd.Series)   #apply(pd.Series) will separate the list values in different columns.
delays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [18]:
delays.columns=['delay_{}'.format(n) for n in range(1,len(delays.columns)+1)]

In [20]:
df.drop('RecentDelays',axis=1)

   FlightNumber              Airline      From         To
0         10045               KLM(!)    LoNDon      paris
1         10055    <Air France> (12)    MAdrid      miLAN
2         10065  (British Airways. )    londON  StockhOlm
3         10075       12. Air France  Budapest      PaRis
4         10085          "Swiss Air"  Brussels     londOn

In [21]:
df.join(delays)

   FlightNumber  RecentDelays              Airline  ... delay_1 delay_2  delay_3
0         10045      [23, 47]               KLM(!)  ...    23.0    47.0      NaN
1         10055            []    <Air France> (12)  ...     NaN     NaN      NaN
2         10065  [24, 43, 87]  (British Airways. )  ...    24.0    43.0     87.0
3         10075          [13]       12. Air France  ...    13.0     NaN      NaN
4         10085      [67, 32]          "Swiss Air"  ...    67.0    32.0      NaN

[5 rows x 8 columns]